In [2]:
# import pandas and create_engine from sqlalchemy
import pandas as pd
from sqlalchemy import create_engine

In [3]:
# establish a database connection
engine = create_engine("postgresql+psycopg2://postgres:postgres@localhost:5432/lahman_baseball")
# Replace `<lahman_baseball_database_name>` with the actual name of your lahman baseball database as it appears in pgadmin

In [4]:
# use the connection to run a query using pandas!
df = pd.read_sql("SELECT * FROM batting;", con=engine)
df.head()

,playerid,yearid,stint,teamid,lgid,g,ab,r,h,h2b,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
0,abercda01,1871,1,TRO,NA,1,4,0,0,0,...,0.0,0.0,0.0,0,0.0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NA,25,118,30,32,6,...,13.0,8.0,1.0,4,0.0,NaN,NaN,NaN,NaN,NaN
2,allisar01,1871,1,CL1,NA,29,137,28,40,4,...,19.0,3.0,1.0,2,5.0,NaN,NaN,NaN,NaN,NaN
3,allisdo01,1871,1,WS3,NA,27,133,28,44,10,...,27.0,1.0,1.0,0,2.0,NaN,NaN,NaN,NaN,NaN
4,ansonca01,1871,1,RC1,NA,25,120,29,39,11,...,16.0,6.0,2.0,2,1.0,NaN,NaN,NaN,NaN,NaN

**Pull In Data**

In [5]:
people = pd.read_sql("SELECT * FROM people", con=engine)
salaries = pd.read_sql("SELECT * FROM salaries", con = engine)
collegeplaying = pd.read_sql("SELECT * FROM collegeplaying", con = engine)
schools = pd.read_sql("SELECT * FROM schools", con = engine)

# 1. Vanderbilt Players

**a. Find all players in the database who played at Vanderbilt University**

In [6]:
vandy = schools[schools['schoolname'] == "Vanderbilt University"]

In [7]:
vandycp = pd.merge(vandy, collegeplaying, how = 'inner', on = 'schoolid')

In [8]:
vandycp.drop('yearid', axis = 'columns', inplace = True)
vandycp = vandycp.drop_duplicates()
vandyplayers = pd.merge(vandycp, people, how = 'inner', on = 'playerid')
vandyplayers[['namefirst', 'namelast']]

   namefirst    namelast
0      Pedro     Alvarez
1       Mike      Baxter
2       Nick  Christiani
3     Wilson     Collins
4       Joey        Cora
5       Slim       Embry
6       Ryan    Flaherty
7      Sonny        Gray
8     Harvey    Hendrick
9       Matt        Kata
10    Jensen       Lewis
11    Scotti     Madison
12      Mike       Minor
13   Scrappy       Moore
14       Mal        Moss
15      Josh        Paul
16     David       Price
17      Mark       Prior
18    Antoan  Richardson
19     Scott   Sanderson
20       Rip      Sewell
21    Jeremy      Sowers
22      Mike      Willis
23      Josh        Zeid

**b. Create a list showing each playerâ€™s first and last names as well as the total salary they earned in the major leagues.**

In [9]:
vandy_salaries = pd.merge(vandyplayers[['playerid', 'namefirst', 'namelast']], salaries, how = 'left', on = 'playerid')

In [10]:
vandy_sum = vandy_salaries.groupby(['playerid', 'namefirst', 'namelast'], as_index = False).sum()
vandy_sum.drop(['playerid', 'yearid'], axis = 'columns', inplace = True)
vandy_sum

   namefirst    namelast      salary
0      Pedro     Alvarez  20681704.0
1       Mike      Baxter   2094418.0
2       Nick  Christiani    500000.0
3     Wilson     Collins         0.0
4       Joey        Cora   5622500.0
5       Slim       Embry         0.0
6       Ryan    Flaherty   4061000.0
7      Sonny        Gray   1542500.0
8     Harvey    Hendrick         0.0
9       Matt        Kata   1060000.0
10    Jensen       Lewis   1234000.0
11    Scotti     Madison    135000.0
12      Mike       Minor   6837500.0
13   Scrappy       Moore         0.0
14       Mal        Moss         0.0
15      Josh        Paul   2640000.0
16     David       Price  81851296.0
17      Mark       Prior  12800000.0
18    Antoan  Richardson         0.0
19     Scott   Sanderson  10750000.0
20       Rip      Sewell         0.0
21    Jeremy      Sowers    384800.0
22      Mike      Willis         0.0
23      Josh        Zeid         0.0

**c. Sort this list in descending order by the total salary earned.**

In [17]:
vandy_sum.sort_values('salary',ascending=False)

   namefirst    namelast      salary
16     David       Price  81851296.0
0      Pedro     Alvarez  20681704.0
17      Mark       Prior  12800000.0
19     Scott   Sanderson  10750000.0
12      Mike       Minor   6837500.0
4       Joey        Cora   5622500.0
6       Ryan    Flaherty   4061000.0
15      Josh        Paul   2640000.0
1       Mike      Baxter   2094418.0
7      Sonny        Gray   1542500.0
10    Jensen       Lewis   1234000.0
9       Matt        Kata   1060000.0
2       Nick  Christiani    500000.0
21    Jeremy      Sowers    384800.0
11    Scotti     Madison    135000.0
5       Slim       Embry         0.0
22      Mike      Willis         0.0
20       Rip      Sewell         0.0
14       Mal        Moss         0.0
18    Antoan  Richardson         0.0
3     Wilson     Collins         0.0
13   Scrappy       Moore         0.0
8     Harvey    Hendrick         0.0
23      Josh        Zeid         0.0

**d. Which Vanderbilt player earned the most money in the majors?**

In [12]:
# David Price earned the most money with $81,851,296.

# Question 2 

**Using the fielding table, group players into three groups based on their position: label players with position OF as "Outfield", those with position "SS", "1B", "2B", and "3B" as "Infield", and those with position "P" or "C" as "Battery". Determine the number of putouts made by each of these three groups in 2016.**

In [13]:
fielding = pd.read_sql("SELECT * FROM fielding", con = engine)

In [14]:
fielding

,playerid,yearid,stint,teamid,lgid,pos,g,gs,innouts,po,a,e,dp,pb,wp,sb,cs,zr
0,abercda01,1871,1,TRO,NA,SS,1,NaN,NaN,1,3.0,2.0,0.0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NA,2B,22,NaN,NaN,67,72.0,42.0,5.0,NaN,NaN,NaN,NaN,NaN
2,addybo01,1871,1,RC1,NA,SS,3,NaN,NaN,8,14.0,7.0,0.0,NaN,NaN,NaN,NaN,NaN
3,allisar01,1871,1,CL1,NA,2B,2,NaN,NaN,1,4.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN
4,allisar01,1871,1,CL1,NA,OF,29,NaN,NaN,51,3.0,7.0,1.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
136810,zobribe01,2016,1,CHN,NL,2B,119,113.0,2929.0,177,250.0,7.0,52.0,NaN,NaN,NaN,NaN,NaN
136811,zobribe01,2016,1,CHN,NL,OF,46,29.0,859.0,43,1.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN
136812,zobribe01,2016,1,CHN,NL,SS,1,0.0,6.0,0,0.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN
136813,zuninmi01,2016,1,SEA,AL,C,52,48.0,1331.0,400,15.0,0.0,0.0,3.0,NaN,19.0,7.0,NaN
136814,zychto01,2016,1,SEA,AL,P,12,0.0,41.0,0,0.0,1.0,0.0,NaN,NaN,NaN,NaN,NaN

In [15]:
position=[]
for i in fielding['pos']:
    if i == 'OF':
        position.append('Outfield')
    elif i in['SS','1B','2B','3B']:
        position.append('Infield')
    elif i in ['P','C']:
        position.append('Battery')
    else:
        position.append('none')
    
fielding["group"] = position
fielding2016 = fielding[fielding['yearid'] == 2016]
fielding2016[['po', 'group']].groupby('group', as_index = False).sum()

      group     po
0   Battery  41424
1   Infield  58934
2  Outfield  29560

# 3. World Series 

**a. From 1970 â€“ 2016, what is the largest number of wins for a team that did not win the world series?**

In [16]:
teams = pd.read_sql("SELECT * FROM teams", con = engine)
teams

,yearid,lgid,teamid,franchid,divid,rank,g,ghome,w,l,...,dp,fp,name,park,attendance,bpf,ppf,teamidbr,teamidlahman45,teamidretro
0,1871,NA,BS1,BNA,None,3,31,NaN,20,10,...,NaN,0.838,Boston Red Stockings,South End Grounds I,NaN,103,98,BOS,BS1,BS1
1,1871,NA,CH1,CNA,None,2,28,NaN,19,9,...,NaN,0.829,Chicago White Stockings,Union Base-Ball Grounds,NaN,104,102,CHI,CH1,CH1
2,1871,NA,CL1,CFC,None,8,29,NaN,10,19,...,NaN,0.814,Cleveland Forest Citys,National Association Grounds,NaN,96,100,CLE,CL1,CL1
3,1871,NA,FW1,KEK,None,7,19,NaN,7,12,...,NaN,0.803,Fort Wayne Kekiongas,Hamilton Field,NaN,101,107,KEK,FW1,FW1
4,1871,NA,NY2,NNA,None,5,33,NaN,16,17,...,NaN,0.839,New York Mutuals,Union Grounds (Brooklyn),NaN,90,88,NYU,NY2,NY2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2830,2016,NL,SLN,STL,C,2,162,81.0,86,76,...,169.0,0.983,St. Louis Cardinals,Busch Stadium III,3444490.0,100,99,STL,SLN,SLN
2831,2016,AL,TBA,TBD,E,5,162,81.0,68,94,...,129.0,0.984,Tampa Bay Rays,Tropicana Field,1286163.0,93,94,TBR,TBA,TBA
2832,2016,AL,TEX,TEX,W,1,162,81.0,95,67,...,190.0,0.984,Texas Rangers,Rangers Ballpark in Arlington,2710402.0,106,105,TEX,TEX,TEX
2833,2016,AL,TOR,TOR,E,2,162,81.0,89,73,...,144.0,0.986,Toronto Blue Jays,Rogers Centre,3392099.0,111,110,TOR,TOR,TOR
2834,2016,NL,WAS,WSN,E,1,162,81.0,95,67,...,142.0,0.988,Washington Nationals,Nationals Park,2481938.0,100,98,WSN,MON,WAS

In [27]:
teams.loc[(teams["yearid"].between(1970, 2016)) & (teams["wswin"] != "Y"),
          ["yearid", "franchid", "name", "w", "wswin"]].sort_values("w", ascending = False).head(1)

      yearid franchid              name    w wswin
2379    2001      SEA  Seattle Mariners  116     N

**b. What is the smallest number of wins for a team that did win the world series?**

In [29]:
teams.loc[(teams["yearid"].between(1970, 2016)) & (teams["wswin"] == "Y"),
          ["yearid", "franchid", "name", "w", "wswin"]].sort_values("w", ascending = True).head(5)

      yearid franchid                  name   w wswin
1824    1981      LAD   Los Angeles Dodgers  63     Y
2530    2006      STL   St. Louis Cardinals  83     Y
1981    1987      MIN       Minnesota Twins  85     Y
2343    2000      NYY      New York Yankees  87     Y
2769    2014      SFG  San Francisco Giants  88     Y

**c. Doing this will probably result in an unusually small number of wins for a world series champion â€“ determine why this is the case.**

There was a strike in the 1981 season that lasted from June 12 - July 31

**d. Then redo your query, excluding the problem year.**

In [30]:
teams.loc[(teams["yearid"].between(1970, 2016)) & (teams["wswin"] == "Y") & (teams["yearid"] != 1981), 
             ["yearid", "franchid", "name", "w", "wswin"]].sort_values("w", ascending = True).head(1)

      yearid franchid                 name   w wswin
2530    2006      STL  St. Louis Cardinals  83     Y

**e. How often from 1970 â€“ 2016 was it the case that a team with the most wins also won the world series?**

In [32]:
max_wins = teams.loc[teams.groupby(['yearid'])['w'].idxmax()]
max_wins.loc[max_wins["yearid"].between(1970, 2016), "wswin"].value_counts()

N    34
Y    12
Name: wswin, dtype: int64

**f. What percentage of the time?**

In [34]:
max_wins.loc[max_wins["yearid"].between(1970, 2016), 
             ["yearid", "franchid", "wswin"]].groupby('wswin')['franchid'].count().transform(lambda x: round(x/x.sum() * 100, 1))

wswin
N    73.9
Y    26.1
Name: franchid, dtype: float64

# Question 4

**Which managers have won the TSN Manager of the Year award in both the National League (NL) and the American League (AL)? Give their full name and the teams that they were managing when they won the award.**

In [38]:
awardsmanagers = pd.read_sql("SELECT * FROM awardsmanagers;", con=engine)

In [39]:
managers = pd.read_sql("SELECT * FROM managers;", con=engine)

In [41]:
multiple_awards = awardsmanagers_df.loc[(awardsmanagers["lgid"].isin(["AL", "NL"])) & (awardsmanagers["awardid"] == "TSN Manager of the Year")]\
                   [["playerid", "lgid"]]\
                .drop_duplicates()\
                .groupby("playerid")\
                .count()\
                .rename(columns = {"lgid": "award_count"})\
                .reset_index()\
                .query("award_count > 1")\
                .merge(people, how = "left", on = "playerid")\
                .loc[:,["namefirst", "namelast", "playerid"]]

multiple_awards

  namefirst namelast   playerid
0     Davey  Johnson  johnsda02
1       Jim  Leyland  leylaji99